data/perf/campaign-f3deebfbab60/flag-mysql/mysql/tsan-dom_peeling-ea-lo-st-swmr-nofe/warmup1/select_random_points.txt
Sysbench script: /usr/share/sysbench/select_random_points.lua
sysbench /usr/share/sysbench/select_random_points.lua --mysql-user=root --mysql-socket=/tmp/mysql.sock  --threads=36 --time=180 --rand-type=special run | awk '/Latency \(ms\):/ { exit; } 1'
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 36
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            63716
        write:                           0
        other:                           0
        total:                           63716
    transactions:                        63716  (353.88 per sec.)
    queries:                             63716  (353.88 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          180.0439s
    total number of events:              63716

MySQL build: ..